_stack_1st_260614/report_format.org
#+qiita_public: 3373e54f1538036d0cf4
#+OPTIONS: ^:{}
#+STARTUP: indent nolineimages overview num
#+TITLE: レポートの体裁
#+AUTHOR: Shigeto R. Nishitani
#+EMAIL:     (concat "shigeto_nishitani@mac.com")
#+LANGUAGE:  jp
#+OPTIONS:   H:4 toc:t num:2
#+TAG: Markdown, Format
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/html-theme-readtheorg.setup

* レポートのコツ
MS-Wordのmetapher(比喩)はもともとタイプライターで，
textを平文で打つイメージでした．
その後，版組や写植の技術も取り込んで進化し，
文章の体裁を整えて見栄えを良くできるようになってきています．
プログラマは，Wordを超えるいくつものより便利なツールを手に入れていますが，
それらの元になるのは，WYSIWYG(/"what you see is what you get"/)のtasteです．
それをこの講義で身につけてください．

コツは，「文章」の中身にはなく，
「文書」のパーツ(構成要素)を適切に組み合わせることです．

文書の構成要素は，
- タイトル，作者情報
- 平文（段落，フォントサイズ，）
- head(階層)
- リスト(記号付き，数字付き，宣言的)
- 図・表(番号，キャプション，参照)
- 数式
- 引用
- 参照文献
からなります．これらの掟を見抜く目を身につけてください．[[https://qiita.com/daddygongon/items/a0f204107e32c82f52ea][
*Markdownはそれを強制*]]します．

* 体裁：文書パーツの着眼点
  :PROPERTIES:
  :CUSTOM_ID: 体裁文書パーツの着眼点
  :END:
** 段落の体裁
   :PROPERTIES:
   :CUSTOM_ID: 段落の体裁
   :END:

- 配置は両端揃え
- 表題(title)はゴシック，センタリング
- 学籍番号，所属，名前は右詰め
- 見出しはゴシック．
- 字下げはスペースではなくインデントで調整

  - ドキュメントの上の目盛りをいじって下げてね
  - 引用した文章は両端のインデントを小さめにする．
  - リスト(箇条書き)では，字下げを逆にする(つきだし，あるいはぶら下がり)と見栄えが良い．

** フォントの体裁
   :PROPERTIES:
   :CUSTOM_ID: フォントの体裁
   :END:

- 本文は明朝，見出し(/, *, */)はゴシック
- レポートのページ数はフォントの大きさで調整．
- レポートでフォントの大きさが指定されたときは，行間で調整(最終手段)

** 図表のキャプション(caption)
   :PROPERTIES:
   :CUSTOM_ID: 図表のキャプションcaption
   :END:

- キャプションとは図表の内容を説明する文章．
- 図は下に，表は上にキャプションを配置．
- 図，表それぞれで通し番号をつける．
- キャプションも文章なので，最後はピリオドで終わる．

** 引用(quote)[fn:1]
   :PROPERTIES:
   :CUSTOM_ID: 引用quotequote
   :END:

- 無断の引用は剽窃になる．
- 短いときは鉤括弧「」でくくる．
- 英語は斜体(italic)かクオーテーション(', ")
- 長いときは，block quoteと呼び，両端にインデントをとって本文と区別する
- 引用元を明示する．
- 角括弧[1]か上つき[fn:2]にして，番号をふり文末に参考文献としてまとめる．

** 参考文献(references)
   :PROPERTIES:
   :CUSTOM_ID: 参考文献references
   :END:

- 本文で出てきた順にナンバリングする．
- 著者・題目・出版社・出版年をかく（体裁，書き方をそろえること！）．
- ピリオドで終わる．
- 本文中の引用元の記載は[文献のナンバリング,引用元のページ数]というように書く．
- 本文で引用されていない参考文献はない．

* 完成例
  :PROPERTIES:
  :CUSTOM_ID: 完成例
  :END:
完成例は，

- [[https://kwanseio365-my.sharepoint.com/:b:/g/personal/cru32369_nuc_kwansei_ac_jp/EdBfZhctRGRDqwfSOd0TOwMBm3Qz9EjF39Zb2PWo1FrhHw?e=a7hVOi][完成例]]

です．私は，こんだけ整えるのに1時間とか，かかってしまいます :sob:
．なんで，Markdown:bowtie: .
そうすれば文章の中身に集中することができます:smile:．

* おまけ(appendixとかsupplement)
  :PROPERTIES:
  :CUSTOM_ID: おまけappendixとかsupplement
  :END:
** 明朝とゴシックの違いとは？？
   :PROPERTIES:
   :CUSTOM_ID: 明朝とゴシックの違いとは
   :END:
書体は，欧米ではcalligraphyという一つの学問になってます．Appleの創始者のSteve
Jobsが大学でそれしか学ばなかったのは有名な話． 
- 文字の『止め』『跳ね』があるのが明朝体（教科書体） 
- 文字が太めで均一なのがゴシック体(強調体，見出し体)，校正ではゴチとも書く． 
- 欧文のSerif(セリフ)とSans-serif(サンセリフ)に対応 
- Serifは文字の端っこに付いている飾り線（ひげ） 
- 『Sans』はフランス語で『ない』という意味 
- roman(正体，立体), *bold(太字)*, /italic(斜体)/ なんかの書式とはちょと違う

** もう一つのチェックリスト
   :PROPERTIES:
   :CUSTOM_ID: もう一つのチェックリスト
   :END:

| パーツ       | フォント設定他           | 段落設定                   |
|--------------+--------------------------+----------------------------|
| 出力         | .pdf (or .docx)          |                            |
| 題目(title)  | ゴチ(ちょっと大きめ)     | 中央揃え                   |
| 名前(author) | 学籍番号，所属，名前     | 右ヅメ                     |
| 見出し(head) | ゴチ                     | 左ヅメ                     |
| caption      | ゴチ                     | インデント調整             |
| 本文         | 明朝(10-12p)             | 両端揃え(，先頭行一字下げ) |
| 引用(quote)  | 自分の文章と引用との区別 | インデント調整             |



[fn:1] 引用は基本的に引用元にでてくる文章をそのまま使う．長いときとか，概念なんかはまとめてしまうが，参照元を明示．_参考_文献ってのは日本語として確立しているけど，あやふやなイメージを学生は持つので注意すべき．参照も同じかも．

[fn:2] これは例です．

** コメント
- やり方のメモを残す
- レポートの体裁はできています．自分への縛りは，決意表明とか目標ではないので，もっと具体的な項目に落とし込むべきです．
- レポートの最終目標は将来の自分へのメモです．自分の役にたつ言葉・手順を残してください．
- 悪くないよ．スタイルを使う方が便利．キャプションがないので再提出．それと縛りは決意表明ではなく，具体的に．
- 大学で学ぶ一番の利点は友達と切磋琢磨できること．
- 続ける工夫の一つに，divide and conquerというのがあります．目標を細かく分けて一つ一つ達成を積み重ねるやり方です．記録するのを忘れずに
